AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов</Name>
			<Comment>(Общ) Оперативное ведение расчетов с контрагентами по договорам с учетом расчетов по документам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета для договоров в у.е. </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетовСКонтрагентом</Name>
					<Comment>Незакрытый документ поставки/оплаты</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетовСКонтрагентом</Name>
					<Comment>Вид расчетов (по приобретению, по реализации, прочее)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетовСКонтрагентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УпрУчет</Name>
					<Comment>Отражается ли документ расчетов с контрагентами в управленческом учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварДоставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПередан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНеДоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийОплатаОтПокупателяПлатежнойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаОтПокупателяПлатежнойКартой</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/PortalPayments/Ext/Module.bsl
///////////////////Функции методов веб сервиса///////////////////
Функция ПолучитьСписокРеализацийДляОплаты(КодМДМФилиала, ДатаНачала, ДатаОкончания, НомерДетали, НомерДокумента)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. ПолучитьСписокРеализацийДляОплаты");
	
	ПараметрыЗапуска = "КодМДМФилиала: "  +  КодМДМФилиала + "ДатаНачала: " + ДатаНачала + "ДатаОкончания: " + ДатаОкончания + "НомерДетали: " + НомерДетали 
	+ "НомерДокумента: " + НомерДокумента;   
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Параметры. ПолучитьСписокРеализацийДляОплаты" + Символы.ПС + ПараметрыЗапуска);

	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");
	
	Если Не ЗначениеЗаполнено(КодМДМФилиала) Тогда		
		
		СтруктураВозврата.Сообщение = "Не заполнен код МДМ филиала"; 
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСписокРеализацийДляОплаты " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", КодМДМФилиала);	
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда		
		
		СтруктураВозврата.Сообщение = "Не был найден филиал по коду МДМ: " + КодМДМФилиала;
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСписокРеализацийДляОплаты " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг) КАК Реализация,
	|	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	|	МАКСИМУМ(ПродажиОбороты.ЗаказПокупателя.ДатаОтгрузки) КАК ДатаДоставки,
	|	МАКСИМУМ(СчетФактураВыданный.Ссылка) КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			,
	|			,
	|			ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	|				И ВЫРАЗИТЬ(ДокументПродажи КАК Документ.РеализацияТоваровУслуг).Грузополучатель = &Филиал
	|				И (ВЫРАЗИТЬ(ДокументПродажи КАК Документ.РеализацияТоваровУслуг).Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|				И ((ВЫРАЗИТЬ(&Артикул КАК СТРОКА(20))) = """"
	|					ИЛИ Номенклатура.НормализованныйКод ПОДОБНО &Артикул)) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументОснование
	|			И (СчетФактураВыданный.Проведен)
	|ГДЕ
	|	((ВЫРАЗИТЬ(&Номер КАК СТРОКА(20))) = """"
	|			ИЛИ ВЫБОР
	|				КОГДА СчетФактураВыданный.Номер ЕСТЬ NULL
	|					ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг).Номер ПОДОБНО &Номер
	|				ИНАЧЕ СчетФактураВыданный.Номер ПОДОБНО &Номер
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0) КАК ИтогоКОплатеПоОстаткам,
	|	ВТ_Реализации.Реализация.СуммаДокумента КАК ИтогоКОплате,
	|	ВТ_Реализации.Реализация.Дата КАК Дата,
	|	ВТ_Реализации.Реализация.ВалютаДокумента.Наименование КАК Валюта,
	|	ВТ_Реализации.Реализация.Ссылка КАК Реализация,
	|	ЕСТЬNULL(ВТ_Реализации.Реализация.Водитель.Наименование, """") КАК Водитель,
	|	ВТ_Реализации.Реализация.Грузополучатель.Наименование КАК Филиал,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0) > 0
	|				И ЕСТЬNULL(СвойствоЗаблокированоДляОплаты.Значение, ЛОЖЬ) = ЛОЖЬ
	|				И ВТ_Реализации.Реализация.Организация = &ОсновнаяОрганизация
	|				И &ВключенаОпцияОплатыКартой
	|				И ВТ_Реализации.Реализация.ДоговорКонтрагента.РозничнаяПродажа
	|				И НЕ ЕСТЬNULL(СвойствоСтатусДоставки.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварНеДоставлен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозможностьОплаты,
	|	ЕСТЬNULL(СвойствоСтатусДоставки.Значение, """") КАК Статус,
	|	ВТ_Реализации.Реализация.СуммаДокумента КАК Сумма,
	|	ВТ_Реализации.СчетФактура КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0) <= 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Реализации.Сумма - ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0)
	|	КОНЕЦ КАК Аванс,
	|	ВЫБОР
	|		КОГДА ВТ_Реализации.ДатаДоставки = &ПустаяДата
	|			ТОГДА ВТ_Реализации.Реализация.Дата
	|		ИНАЧЕ ВТ_Реализации.ДатаДоставки
	|	КОНЕЦ КАК ДатаДоставки,
	|	ЕСТЬNULL(ТелефонВодителя.Представление, """") КАК ТелефонВодителя,
	|	ВТ_Реализации.Реализация.Контрагент.Наименование КАК Контрагент
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|				,
	|				ДокументРасчетовСКонтрагентом ССЫЛКА Документ.РеализацияТоваровУслуг
	|					И ВЫРАЗИТЬ(ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Грузополучатель = &Филиал) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|		ПО ВТ_Реализации.Реализация = ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоСтатусДоставки
	|		ПО (СвойствоСтатусДоставки.Свойство = &СвойствоДоставки)
	|			И ВТ_Реализации.Реализация = СвойствоСтатусДоставки.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоЗаблокированоДляОплаты
	|		ПО ВТ_Реализации.Реализация = СвойствоЗаблокированоДляОплаты.Объект
	|			И (СвойствоЗаблокированоДляОплаты.Свойство = &СвойствоЗаблокировано)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонВодителя
	|		ПО ВТ_Реализации.Реализация.Водитель = ТелефонВодителя.Объект
	|			И (ТелефонВодителя.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (ТелефонВодителя.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура.Родитель.Наименование КАК Бренд,
	|	ПродажиОбороты.Номенклатура.КодПроизводителя КАК Артикул,
	|	ПродажиОбороты.Номенклатура.Наименование КАК Наименование,
	|	ПродажиОбороты.КоличествоОборот КАК Количество,
	|	ПродажиОбороты.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот КАК Цена,
	|	ПродажиОбороты.СтоимостьОборот КАК Сумма,
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг) КАК Реализация
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДокументПродажи В
	|					(ВЫБРАТЬ
	|						ВТ_Реализации.Реализация
	|					ИЗ
	|						ВТ_Реализации)
	|				И ((ВЫРАЗИТЬ(&Артикул КАК СТРОКА(20))) = """"
	|					ИЛИ Номенклатура.НормализованныйКод ПОДОБНО &Артикул)) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг";
	
	Запрос.УстановитьПараметр("Филиал", Контрагент);
	Запрос.УстановитьПараметр("СвойствоДоставки", ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки);
	Запрос.УстановитьПараметр("СвойствоЗаблокировано", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ОсновнаяОрганизация", Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ВключенаОпцияОплатыКартой", Константы.ИспользоватьОплатыКартой.Получить());
	
	ОчищенныйКодПроизводителя = "";
	СтрокаПроверки = СокрЛП(НомерДетали);
	Длина = СтрДлина(СтрокаПроверки);
	
	Для а = 1 По Длина Цикл
		
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
		КонецЕсли; 
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Артикул", ?(СокрЛП(ОчищенныйКодПроизводителя) <> "", "%" + ОчищенныйКодПроизводителя + "%", ""));
	Запрос.УстановитьПараметр("Номер", ?(СокрЛП(НомерДокумента) <> "", "%" + СокрЛП(НомерДокумента) + "%", ""));
	
	МассивДанных = Новый Массив;
	
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаШапок = Пакет[1].Выгрузить();
	ТаблицаТоваров = Пакет[2].Выгрузить();
	
	Для каждого СтрШапка ИЗ ТаблицаШапок Цикл
		
		СтрТовары = ТаблицаТоваров.НайтиСтроки(Новый Структура("Реализация", СтрШапка.Реализация));
		
		СтруктураДанных = Новый Структура("ИД, Дата, Номер, Валюта, Сумма, ИтогоКОплате, Аванс, Водитель, ТелефонВодителя, Контрагент, Филиал, ДатаДоставки, ВозможностьОплаты, Статус, Товары");
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрШапка);
		
		СтруктураДанных.ИД = Строка(СтрШапка.Реализация.УникальныйИдентификатор());
		
		Если ЗначениеЗаполнено(СтруктураДанных.Статус) Тогда
			
			Если СтруктураДанных.Статус = Перечисления.СтатусыДоставки.ТоварДоставляется Тогда
				СтруктураДанных.Статус = "Доставляется";
			ИначеЕсли СтруктураДанных.Статус = Перечисления.СтатусыДоставки.ТоварНеДоставлен Тогда
				СтруктураДанных.Статус = "Доставляется";
			ИначеЕсли СтруктураДанных.Статус = Перечисления.СтатусыДоставки.ТоварПередан Тогда
				СтруктураДанных.Статус = "Отгружен";
			Иначе
				СтруктураДанных.Статус = "";
			КонецЕсли;
			
		Иначе
			СтруктураДанных.Статус = "Доставляется";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрШапка.СчетФактура) Тогда
			СтруктураДанных.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(СтрШапка.СчетФактура);
		Иначе
			СтруктураДанных.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(СтрШапка.Реализация);
		КонецЕсли;
		
		МассивТоваров = Новый Массив;
		
		Для каждого СтрТовар ИЗ СтрТовары Цикл
			
			СтруктураТовара = Новый Структура("Бренд, Артикул, Наименование, Количество, ЕдиницаИзмерения, Цена, Сумма");
			
			ЗаполнитьЗначенияСвойств(СтруктураТовара, СтрТовар);
			
			МассивТоваров.Добавить(СтруктураТовара);
			
		КонецЦикла;
		
		СтруктураДанных.Товары = МассивТоваров;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	СтруктураВозврата.Данные = МассивДанных;
	СтруктураВозврата.Результат = Истина;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСписокРеализацийДляОплаты " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Чеки.ВернутьJSON(СтруктураВозврата);
	
КонецФункции

Функция ЗаблокироватьРеализацию(ИД)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ЗаблокироватьРеализацию");
	ПараметрыЗапуска = "ИД: " + ИД;   
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. ЗаблокироватьРеализацию" + Символы.ПС + ПараметрыЗапуска);
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	Если Не ЗначениеЗаполнено(ИД) Тогда		
		
		СтруктураВозврата.Сообщение = "Не заполнен идентификатор реализации";    
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ЗаблокироватьРеализацию " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;
	
	Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));	
	
	Если Реализация.ПолучитьОбъект() = Неопределено Тогда		
		
		СтруктураВозврата.Сообщение = "Не была найдена реализация по ИД: " + ИД;  
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ЗаблокироватьРеализацию " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;
	
	СтатусЗаблокировано = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	СтатусЗаблокировано.Отбор.Объект.Установить(Реализация);
	СтатусЗаблокировано.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты);
	
	УстановитьПривилегированныйРежим(Истина);	
	СтатусЗаблокировано.Прочитать();
	УстановитьПривилегированныйРежим(Ложь);	
	
	Если СтатусЗаблокировано.Количество() = 0 Тогда
		
		НовыйСтатусЗаблокировано = СтатусЗаблокировано.Добавить();
		НовыйСтатусЗаблокировано.Объект = Реализация;
		НовыйСтатусЗаблокировано.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты;
		
	Иначе
		НовыйСтатусЗаблокировано = СтатусЗаблокировано[0];
	КонецЕсли;
	
	НовыйСтатусЗаблокировано.Значение = Истина;
	
	УстановитьПривилегированныйРежим(Истина);	
	СтатусЗаблокировано.Записать();
	УстановитьПривилегированныйРежим(Ложь);		
	
	СтруктураВозврата.Результат = Истина;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ЗаблокироватьРеализацию " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Чеки.ВернутьJSON(СтруктураВозврата);
	
КонецФункции

Функция ПолучитьСуммуДляОплатыПоРеализации(ИД)  
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьСуммуДляОплатыПоРеализации");
	ПараметрыЗапуска = "ИД: " + ИД;   
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. ПолучитьСуммуДляОплатыПоРеализации" + Символы.ПС + ПараметрыЗапуска);
	
	СтруктураВозврата = Новый Структура("Результат, Сумма, Сообщение", Ложь, 0, "");
	
	Если Не ЗначениеЗаполнено(ИД) Тогда	
		
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = "Не заполнен идентификатор реализации"; 
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДляОплатыПоРеализации " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;
	
	Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));	
	
	Если Реализация.ПолучитьОбъект() = Неопределено Тогда
		
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = "Не была найдена реализация по ИД: " + ИД; 
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДляОплатыПоРеализации " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;  
	
	Если НЕ ПроверитьРеализациюНаВозможностьОплаты(Реализация) Тогда
		
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = "Документ реализация не актуален"; 
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДляОплатыПоРеализации " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли; 

	СтруктураВозврата.Сумма = Реализация.СуммаДокумента;
	СтруктураВозврата.Результат = Истина;
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Завершение. ПолучитьСуммуДляОплатыПоРеализации " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));

	Возврат Чеки.ВернутьJSON(СтруктураВозврата); 
	
КонецФункции

Функция СоздатьОплатуПлатежнойКартойВерсия_Общая(НомерТерминала, ИДПлатежа, ИДДокумента, Сумма, ЛицевойСчет = Ложь, ДанныеПоОплате = "")
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. СоздатьОплатуПлатежнойКартой_вер2");	
	
	//ПараметрыЗапуска = "НомерТерминала: " + НомерТерминала + " ИДПлатежа: " + ИДПлатежа + " ИДДокумента: " + ИДДокумента + " Сумма: " + Строка(Сумма); 
	ПараметрыЗапуска = "id=:" + ИДДокумента + ";terminal=:" + НомерТерминала + ";bank_id:" + ИДПлатежа + ";summ:" + Строка(Сумма) + ";typ=" + ?(ЛицевойСчет, "1", "0") + ";ptxt=" + СокрЛП(ДанныеПоОплате);
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. СоздатьОплатуПлатежнойКартой_вер2" + Символы.ПС + ПараметрыЗапуска);

	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	Если Не ЗначениеЗаполнено(НомерТерминала) Тогда		
		
		СтруктураВозврата.Сообщение = "Не заполнен номер терминала"; 
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;
	
	ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.НайтиПоРеквизиту("Номер", НомерТерминала);
	
	Если Не ЗначениеЗаполнено(ДоговорЭквайринга) Тогда		
		
		СтруктураВозврата.Сообщение = "Не найден договор эквайринга по номеру: " + НомерТерминала;  
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИДДокумента) Тогда
		
		СтруктураВозврата.Сообщение = "Не заполнен идентификатор "+?(ЛицевойСчет,"договора","реализации"); 
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;
	
	Если ЛицевойСчет Тогда 
		
		Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ",ИДДокумента);	
		
		Если ДоговорКонтрагента.Пустая() Тогда		
			
			СтруктураВозврата.Сообщение = "Не был найден договор контрагента по ИД : " + ИДДокумента; 
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
			
		КонецЕсли; 	
		
		Контрагент = ДоговорКонтрагента.Владелец;

	Иначе	
		
		Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДокумента));	
		
		Если Реализация.ПолучитьОбъект() = Неопределено Тогда		
			
			СтруктураВозврата.Сообщение = "Не была найдена реализация по ИД: " + ИДДокумента; 
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
			
		КонецЕсли; 
		
		ДоговорКонтрагента = Реализация.ДоговорКонтрагента;
		Контрагент = Реализация.Контрагент;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(Сумма) Тогда		
		
		СтруктураВозврата.Сообщение = "Не заполнена сумма платежа";
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецЕсли;                                          
	
	ДокументСИДПлатежаСуществует = ПроверитьДокументСуществует(ИДПлатежа); 
	
	Если ДокументСИДПлатежаСуществует Тогда
		
		//+Гавриленков В. 24.01.2026 #UT10-5652
		СтруктураВозврата.Результат = Истина;
		//-Гавриленков В. 24.01.2026 #UT10-5652
		СтруктураВозврата.Сообщение = "Документ с ID платежа " + ИДПлатежа + " уже существует";
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);	
		
	КонецЕсли;
	
	Попытка
		
		НовыйДокумент                                 = Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
		НовыйДокумент.Дата                            = ТекущаяДата();
		НовыйДокумент.Организация                     = ДоговорЭквайринга.ДоговорВзаиморасчетов.Организация;
		НовыйДокумент.Ответственный                   = Пользователи.ТекущийПользователь(); 	
		НовыйДокумент.ДоговорЭквайринга               = ДоговорЭквайринга;
		НовыйДокумент.Эквайрер                        = ДоговорЭквайринга.Эквайрер;
		
		Если НЕ ДоговорЭквайринга.ТарифыЗаРасчетноеОбслуживание.Количество() = 0 Тогда
			
			НовыйДокумент.ВидОплаты                   = ДоговорЭквайринга.ТарифыЗаРасчетноеОбслуживание[0].ВидОплаты;			
			ПроцентТорговойУступки                    = УправлениеРозничнойТорговлей.ПолучитьПроцентТорговойУступки(ДоговорЭквайринга, НовыйДокумент.ВидОплаты);
			НовыйДокумент.СуммаТорговойУступки        = Сумма * ПроцентТорговойУступки / 100;
			НовыйДокумент.ПроцентТорговойУступки      = ПроцентТорговойУступки;
			
		КонецЕсли;		
		
		НовыйДокумент.ДоговорВзаиморасчетовЭквайрера  = ДоговорЭквайринга.ДоговорВзаиморасчетов;
		НовыйДокумент.Касса                           = ДоговорЭквайринга.Касса;		
		НовыйДокумент.ИДПлатежа                       = ИДПлатежа;
		НовыйДокумент.Контрагент                      = Контрагент;
		НовыйДокумент.ВидОперации                     = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя;
		НовыйДокумент.ВалютаДокумента                 = ДоговорЭквайринга.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;		
		НовыйДокумент.КурсДокумента                   = 1;
		НовыйДокумент.КратностьДокумента              = 1;
		НовыйДокумент.СуммаДокумента                  = Сумма;
		НовыйДокумент.ОтражатьВУправленческомУчете    = Истина;

		Если НовыйДокумент.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
			
			НовыйДокумент.ОтражатьВБухгалтерскомУчете = Истина;
			НовыйДокумент.ОтражатьВНалоговомУчете     = Истина;
			
		КонецЕсли;
		
		//+Белов А. 07.08.2025 #UT10-5370
		НовыйДокумент.ДанныеПоОплате = ДанныеПоОплате;
		//-Белов А. 07.08.2025 #UT10-5370

		Если НЕ ЛицевойСчет Тогда
			
			РасшифровкаПлатежа                               = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			РеализацияСсылка                                 = Реализация;
			РасшифровкаПлатежа.ДоговорКонтрагента            = ДоговорКонтрагента;			
			РасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = Реализация;
			РасшифровкаПлатежа.Сделка                        = РеализацияСсылка.Сделка;
			РасшифровкаПлатежа.КратностьВзаиморасчетов       = НовыйДокумент.КратностьДокумента;
			РасшифровкаПлатежа.КурсВзаиморасчетов            = НовыйДокумент.КурсДокумента;	
			//+Гавриленков В. 06.12.2025 #UT10-5574
			//РасшифровкаПлатежа.СтавкаНДС                     = Перечисления.СтавкиНДС.НДС20; 
			РасшифровкаПлатежа.СтавкаНДС                     = ?(НовыйДокумент.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
			//-Гавриленков В. 06.12.2025 #UT10-5574
			РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = РасшифровкаПлатежа.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
			
			УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(РасшифровкаПлатежа, НовыйДокумент.ВидОперации);
			
			РасшифровкаПлатежа.СуммаВзаиморасчетов           = НовыйДокумент.СуммаДокумента;
			РасшифровкаПлатежа.СуммаПлатежа                  = НовыйДокумент.СуммаДокумента;
			
			ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(РасшифровкаПлатежа.СтавкаНДС);
			
			РасшифровкаПлатежа.СуммаНДС                      = РасшифровкаПлатежа.СуммаПлатежа * ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
			РасшифровкаПлатежа.ПризнакСпособаРасчета         = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
			РасшифровкаПлатежа.Проект                        = РасшифровкаПлатежа.ДоговорКонтрагента.ОсновнойПроект;
			
		Иначе
			
			СтруктураПараметров=Новый Структура;
			
			СтруктураПараметров.Вставить("Организация"					          , НовыйДокумент.Организация);
			СтруктураПараметров.Вставить("Контрагент"					          , НовыйДокумент.Контрагент);
			СтруктураПараметров.Вставить("ВалютаДокумента"				          , НовыйДокумент.ВалютаДокумента);
			СтруктураПараметров.Вставить("СуммаДокумента"				          , НовыйДокумент.СуммаДокумента);
			СтруктураПараметров.Вставить("ДатаДок"						          , НовыйДокумент.Дата);
			СтруктураПараметров.Вставить("ВидОперацииДок"				          , НовыйДокумент.ВидОперации);
			СтруктураПараметров.Вставить("РасшифровкаПлатежа"			          , НовыйДокумент.РасшифровкаПлатежа);
			СтруктураПараметров.Вставить("КурсДокумента"				          , НовыйДокумент.КурсДокумента);
			СтруктураПараметров.Вставить("КратностьДокумента"			          , НовыйДокумент.КратностьДокумента);
			СтруктураПараметров.Вставить("ТипЗадолженности"				          , ">0");
			СтруктураПараметров.Вставить("Интерактивно"					          , Ложь);
			СтруктураПараметров.Вставить("ПлатежПоСуммеВзаиморасчетов"	          , Истина);
			СтруктураПараметров.Вставить("ФормаОплаты"					          , Перечисления.ВидыДенежныхСредств.Наличные);
			СтруктураПараметров.Вставить("ВидОперацииПлан"				          , УправлениеДенежнымиСредствами.ОпределитьВидОперацииПлан(НовыйДокумент.ВидОперации));
			СтруктураПараметров.Вставить("ИмяРегистраПлан"				          , "ПланируемыеПоступленияДенежныхСредств");
			СтруктураПараметров.Вставить("БанковскийСчетКасса"			          , Неопределено);
			СтруктураПараметров.Вставить("СсылкаНаДокумент"				          , НовыйДокумент.Ссылка);
			СтруктураПараметров.Вставить("ОтражатьВБухгалтерскомУчете"	          , НовыйДокумент.ОтражатьВБухгалтерскомУчете);
			
			СтруктураПараметровАвто = Новый Структура; 		
			СтруктураПараметровАвто.Вставить("УчитыватьФактическиеЗадолженности"  , Истина);
			СтруктураПараметровАвто.Вставить("УчитыватьОперативныеЗадолженности"  , Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьСумму"			          , Истина);
			СтруктураПараметровАвто.Вставить("ПодборПоСуммеПлатежа"			      , Истина);
			СтруктураПараметровАвто.Вставить("СуммаДляПодбора"			          , НовыйДокумент.СуммаДокумента);
			СтруктураПараметровАвто.Вставить("СпособЗаполнения"			          , "ФИФО");
			СтруктураПараметровАвто.Вставить("ПоЗаявкам"				          , Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьПланируемыеДвижения"	      , Ложь);
			СтруктураПараметровАвто.Вставить("НеПревышатьЗапланированныхЗначений" , Ложь);
			СтруктураПараметровАвто.Вставить("ВключенныеВПлатежныйКалендарь"      , Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьСумму"                     , Истина);
			СтруктураПараметровАвто.Вставить("ДоговорКонтрагента"                 , ДоговорКонтрагента);   
			СтруктураПараметровАвто.Вставить("ОтбиратьПоДоговорам"                , Истина); 
			
			СтруктураПараметров.Вставить("СтруктураПараметровАвто"		          , СтруктураПараметровАвто);
			
			УправлениеДенежнымиСредствами.ЗаполнитьРасшифровкуПлатежей(СтруктураПараметров);
			
			Если НовыйДокумент.РасшифровкаПлатежа.Количество() = 0 Тогда
				НоваяСтрока = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			КонецЕсли;
			
			НовыйДокумент.СуммаДокумента = НовыйДокумент.РасшифровкаПлатежа.Итог("СуммаПлатежа");
			
		КонецЕсли;

		Если Чеки.ИспользоватьПечатьЧековЧерезСервер() Тогда
			Чеки.ЗаполнитьСоставЧекаККМДляОПК_Оплата(НовыйДокумент);	
		КонецЕсли;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение , РежимПроведенияДокумента.Оперативный);
		
	Исключение
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Ошибка,,, "Веб-сервис:Ошибка. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0") + " Возникла ошибка при создании документа" + Символы.ПС + ПараметрыЗапуска + Символы.ПС + ОписаниеОшибки());
		
		СтруктураВозврата.Сообщение = "Возникла ошибка при проведении документа Оплата платежной картой: " + ОписаниеОшибки();  
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой_вер2 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат Чеки.ВернутьJSON(СтруктураВозврата);		
		
	КонецПопытки;
	
	Попытка
		
		Если Чеки.ИспользоватьПечатьЧековЧерезСервер() Тогда
			
			Док = НовыйДокумент.Ссылка;
			
			Если ЗначениеЗаполнено(Док.Касса.ИД) И Док.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
				
				ЗаписьЖурналаРегистрации("Печать чеков.Начало", УровеньЖурналаРегистрации.Информация, Метаданные.WebСервисы.PortalPayments, , "Начало отправки документов ПКО на печать из системы PortalPayments");								
				
				Если Док.Проведен Тогда
					
					МожноЛиПечататьСтруктура = Чеки.МожноПечататьЧеки(Док.Касса);
					
					Если Не МожноЛиПечататьСтруктура.Результат Тогда
						
						ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Док.Касса , "По кассе " + Строка(Док.Касса) + " в данный момент нельзя печатать чеки" + Символы.ПС + МожноЛиПечататьСтруктура.Сообщение + Символы.ПС + "Документ добавлен в очередь на печать со статусом prepare");								
						Чеки.ЗаписатьНовоеЗадание(Док, "prepare", МожноЛиПечататьСтруктура.Сообщение);				
						
					Иначе
						
						РезультатПроверки = Чеки.ПоверитьКорректностьСоставаЧекаККМ(Док);
						
						Если Не РезультатПроверки.Результат Тогда
							Чеки.ЗаписатьНовоеЗадание(Док, "error", "При проверке корректности состава Чека ККМ обнаружены ошибки" + Символы.ПС + РезультатПроверки.Сообщение);						
						Иначе
							
							СтруктураВозвратаЧека = Чеки.ОтправитьЧекВОчередьНаПечать(Док, Истина,, Константы.АдресПортала.Получить());  
							
							Чеки.ОтправитьЧекиИзПлатежногоДокументаПоРеализациям(Док);
							
							Если НЕ СтруктураВозвратаЧека.Результат Тогда
								
								ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ОплатаОтПокупателяПлатежнойКартой, Док , "Документ не был отправлен в очередь на печать" + Символы.ПС + СтруктураВозвратаЧека.Сообщение + Символы.ПС + "Документ добавлен в очередь на печать со статусом prepare");								
								Чеки.ЗаписатьНовоеЗадание(Док, "prepare", СтруктураВозвратаЧека.Сообщение);
								
							КонецЕсли; 
							
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ОплатаОтПокупателяПлатежнойКартой, Док, "Документ ОПК был записан, но не проведен. Чек не был отправлен на печать в ККМ");		
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.WebСервисы.PortalPayments, , "Окончание отправки документов ПКО на печать из системы PortalPayments");								
				
			КонецЕсли;			
			
		КонецЕсли;
		
	Исключение
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Ошибка,,, "Веб-сервис:Ошибка. СоздатьОплатуПлатежнойКартой " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0") + " Возникла ошибка при печати чека, но документ был создан" + Символы.ПС + ПараметрыЗапуска + Символы.ПС + ОписаниеОшибки());
		
	КонецПопытки;
	
	СтруктураВозврата.Результат = Истина;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0") + Символы.ПС + ПараметрыЗапуска);
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьОплатуПлатежнойКартой " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат Чеки.ВернутьJSON(СтруктураВозврата);
	
КонецФункции

Функция СоздатьОплатуПлатежнойКартой(НомерТерминала, ИДПлатежа, ИДДокумента, Сумма) 
	
	Возврат СоздатьОплатуПлатежнойКартойВерсия_Общая(НомерТерминала, ИДПлатежа, ИДДокумента, Сумма);
	
КонецФункции

Функция СоздатьОплатуПлатежнойКартойВерсия2(НомерТерминала, ИДПлатежа, ИДДокумента, Сумма, ЛицевойСчет)
	
	Возврат СоздатьОплатуПлатежнойКартойВерсия_Общая(НомерТерминала, ИДПлатежа, ИДДокумента, Сумма, ЛицевойСчет);
	
КонецФункции

Функция СоздатьОплатуПлатежнойКартойВерсия3(НомерТерминала, ИДПлатежа, ИДДокумента, Сумма, ЛицевойСчет, ДанныеПоОплате)
//+Белов А. 07.08.2025 #UT10-5370

	Возврат СоздатьОплатуПлатежнойКартойВерсия_Общая(НомерТерминала, ИДПлатежа, ИДДокумента, Сумма, ЛицевойСчет, ДанныеПоОплате)

//-Белов А. 07.08.2025 #UT10-5370	
КонецФункции

Функция ОтправитьКопиюЧека(ИДДокумента, ТипДокумента, Email)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ОтправитьКопиюЧека");	
	ПараметрыЗапуска = "ИДДокумента: " + ИДДокумента + " ТипДокумента: " + ТипДокумента + " Email: " + Email;
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. ОтправитьКопиюЧека" + Символы.ПС + ПараметрыЗапуска);

	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, ""); 
	
	Документ = Неопределено;
	
	Если ТипДокумента = "РеализацияТоваровУслуг" Тогда
		Документ = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДокумента));	
	ИначеЕсли ТипДокумента = "ПриходныйКассовыйОрдер" Тогда
		Документ = Документы.ПриходныйКассовыйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДокумента));
	ИначеЕсли ТипДокумента = "КорректировкаРеализации" Тогда
		Документ = Документы.КорректировкаРеализации.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДокумента)); 
	ИначеЕсли ТипДокумента = "РасходныйКассовыйОрдер" Тогда
		Документ = Документы.РасходныйКассовыйОрдер.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДокумента));
	ИначеЕсли ТипДокумента = "ОплатаОтПокупателяПлатежнойКартой" Тогда
		Документ = Документы.ОплатаОтПокупателяПлатежнойКартой.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДокумента));
	КонецЕсли; 
	
	Если Документ = Неопределено Тогда
		СтруктураВозврата.Сообщение = "Не определен тип документа"; 
	ИначеЕсли Документ.ПолучитьОбъект() = Неопределено Тогда
		СтруктураВозврата.Сообщение = "Не найден документ по ГУИД";
	Иначе      
		
		Если Не ЗначениеЗаполнено(Email) Тогда 			
			Email = Чеки.ПолучитьEmail(Документ.Контрагент);
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(Email) Тогда
			
			Чеки.ДобавитьДокументВОчередьОтправкиКопийЧеков(Документ, Email);
			
			СтруктураВозврата.Результат = Истина;
			СтруктураВозврата.Сообщение = "Отправка копии чека в очередь успешно поставлена";  
			
		Иначе
			СтруктураВозврата.Сообщение = "Не заполнен Email для получения чеков";			
		КонецЕсли;
		
	КонецЕсли;  
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PortalPayments", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ОтправитьКопиюЧека " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0") + Символы.ПС + ПараметрыЗапуска);
	
	Возврат Чеки.ВернутьJSON(СтруктураВозврата);
	
КонецФункции

///////////////////Вспомогательные функции///////////////////  
Функция ПроверитьРеализациюНаВозможностьОплаты(ПромРеализация)
	
	Если НЕ ПромРеализация.Проведен	Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросСтатусаДоставки = Новый Запрос;
	ЗапросСтатусаДоставки.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоСтатусДоставки
	|		ПО РеализацияТоваровУслуг.Ссылка = СвойствоСтатусДоставки.Объект
	|			И (СвойствоСтатусДоставки.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоЗаблокирован
	|		ПО РеализацияТоваровУслуг.Ссылка = СвойствоЗаблокирован.Объект
	|			И (СвойствоЗаблокирован.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты))
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	И НЕ ЕСТЬNULL(СвойствоСтатусДоставки.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварНеДоставлен)
	|	И ЕСТЬNULL(СвойствоЗаблокирован.Значение, ЛОЖЬ) = ЛОЖЬ";  
	
	ЗапросСтатусаДоставки.УстановитьПараметр("Ссылка",ПромРеализация); 

	Возврат НЕ ЗапросСтатусаДоставки.Выполнить().Пустой();
	
КонецФункции

Функция ПроверитьДокументСуществует(ИДПлатежа)  

	ВозвращаемоеЗначение = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаОтПокупателяПлатежнойКартой.Ссылка
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	|ГДЕ
	|	ОплатаОтПокупателяПлатежнойКартой.ПометкаУдаления = ЛОЖЬ
	|	И ОплатаОтПокупателяПлатежнойКартой.ИДПлатежа = &ИДПлатежа
	|	И ОплатаОтПокупателяПлатежнойКартой.ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("ИДПлатежа", ИДПлатежа); 
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя); 
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ВозвращаемоеЗначение = Ложь;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;	

КонецФункции
